config.org
#+title: Emacs config
#+property: header-args:emacs-lisp :tangle init.el
* Table of Contents :TOC:
- [[#early-initialization][Early Initialization]]
- [[#initialization][Initialization]]
- [[#personal-info][Personal Info]]
- [[#package-manager][Package Manager]]
- [[#auto-compile][Auto Compile]]
- [[#gc][GC]]
- [[#defaults][Defaults]]
- [[#async][Async]]
- [[#general][General]]
- [[#evil][Evil]]
- [[#which-key][Which-key]]
- [[#keyboard-layout][Keyboard Layout]]
- [[#tty][TTY]]
- [[#ui][UI]]
- [[#fonts][Fonts]]
- [[#mode-line][Mode Line]]
- [[#theme][Theme]]
- [[#modernized-package-menu][Modernized Package Menu]]
- [[#frames][Frames]]
- [[#tabs][Tabs]]
- [[#windows][Windows]]
- [[#buffers][Buffers]]
- [[#pop-ups][Pop-ups]]
- [[#completion][Completion]]
- [[#files][Files]]
- [[#projects][Projects]]
- [[#dired][Dired]]
- [[#tramp][Tramp]]
- [[#environment-variables][Environment Variables]]
- [[#help][Help]]
- [[#editor][Editor]]
- [[#ediff][Ediff]]
- [[#undoredo][Undo/Redo]]
- [[#highlighting][Highlighting]]
- [[#line-numbers][Line Numbers]]
- [[#auto-completion][Auto Completion]]
- [[#search][Search]]
- [[#folding][Folding]]
- [[#spell-checking][Spell Checking]]
- [[#syntax-checking][Syntax Checking]]
- [[#goto][Goto]]
- [[#file-tree][File Tree]]
- [[#terminal][Terminal]]
- [[#git][Git]]
- [[#org][Org]]
  - [[#common][Common]]
  - [[#archive][Archive]]
  - [[#refile][Refile]]
  - [[#code-blocks][Code Blocks]]
  - [[#lists][Lists]]
  - [[#agenda][Agenda]]
  - [[#faces][Faces]]
  - [[#table-of-contents][Table of Contents]]
  - [[#babel][Babel]]
- [[#lsp][LSP]]
- [[#languages][Languages]]
  - [[#tree-sitter][tree-sitter]]
  - [[#emacs-lisp][Emacs Lisp]]
  - [[#clojure][Clojure]]
  - [[#java][Java]]
  - [[#go][Go]]
  - [[#makefile][Makefile]]
  - [[#js][JS]]
  - [[#web][Web]]
  - [[#plantuml][PlantUML]]
  - [[#sql][SQL]]
  - [[#groovy][Groovy]]
  - [[#markdown][Markdown]]
  - [[#json][JSON]]
  - [[#yaml][YAML]]
  - [[#lua][Lua]]
  - [[#shell][Shell]]
  - [[#config][Config]]
- [[#tools][Tools]]
  - [[#editorconfig][EditorConfig]]
  - [[#docker][Docker]]
  - [[#ansible][Ansible]]
  - [[#http][HTTP]]
  - [[#direnv][direnv]]
- [[#utils][Utils]]
- [[#the-end][The end]]

* Early Initialization
:PROPERTIES:
:header-args:emacs-lisp: :tangle early-init.el
:END:

Enable lexical scope
#+begin_src emacs-lisp
;;; -*- lexical-binding: t; no-byte-compile: t -*-
#+end_src

Default directory
#+begin_src emacs-lisp
(setq default-directory "~/")
#+end_src

Package Manager
#+begin_src emacs-lisp
(setq package-enable-at-startup nil)
#+end_src

GC tweaks
#+begin_src emacs-lisp
(setq gc-cons-threshold most-positive-fixnum)

(add-hook 'emacs-startup-hook
          #'(lambda ()
              (let ((init-time (float-time (time-subtract after-init-time before-init-time)))
                    (packages  (length package-activated-list))
                    (gc-time   (float-time gc-elapsed))
                    (gc-count  gcs-done))
                (message "Emacs ready (init time = %.2fs, packages = %d, gc time = %.2fs, gc count = %d)."
                         init-time packages gc-time gc-count))))
#+end_src

File handler tweaks
#+begin_src emacs-lisp
(defvar -file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)

(add-hook 'emacs-startup-hook
          #'(lambda ()
              (setq file-name-handler-alist -file-name-handler-alist)))
#+end_src

Disable ~site-run-file~
#+begin_src emacs-lisp
(setq site-run-file nil)
#+end_src

UI
#+begin_src emacs-lisp
(setq frame-inhibit-implied-resize t)

(add-to-list 'default-frame-alist '(left . 0.5))
(add-to-list 'default-frame-alist '(top . 0.5))
(add-to-list 'default-frame-alist '(width . 0.75))
(add-to-list 'default-frame-alist '(height . 0.9))
(add-to-list 'default-frame-alist '(menu-bar-lines . 0))
(add-to-list 'default-frame-alist '(tool-bar-lines . 0))
(add-to-list 'default-frame-alist '(vertical-scroll-bars))
(add-to-list 'default-frame-alist '(internal-border-width . 0))
(add-to-list 'default-frame-alist '(tabs
                                    (current-tab
                                     (name . "main")
                                     (explicit-name . t))))
;; (add-to-list 'default-frame-alist '(fullscreen . fullboth))
(add-to-list 'default-frame-alist '(font . "JetBrains Mono 14"))
#+end_src

* Initialization
Enable lexical scope
#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

* Personal Info
#+begin_src emacs-lisp
(setq user-full-name "Ruslan Kamashev"
      user-login-name "rynffoll"
      user-mail-address "rynffoll@gmail.com")
#+end_src

* Package Manager
Setup package
#+begin_src emacs-lisp
(require 'package)
(setq package-archives
      '(("gnu"          . "https://elpa.gnu.org/packages/")
        ("melpa-stable" . "https://stable.melpa.org/packages/")
        ("melpa"        . "https://melpa.org/packages/")
        ("org"          . "https://orgmode.org/elpa/")))

(unless (bound-and-true-p package--initialized) ; To avoid warnings in 27
  (setq package-enable-at-startup nil)          ; To prevent initializing twice
  (package-initialize))
#+end_src

Setup use-package
#+begin_src emacs-lisp
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(setq use-package-always-defer t)
(setq use-package-always-ensure t)
(setq use-package-hook-name-suffix nil)
(setq use-package-enable-imenu-support t)
(setq use-package-compute-statistics t)
(setq use-package-expand-minimally t)

(eval-when-compile
  (require 'use-package))

(use-package quelpa-use-package
  :demand
  :init
  (setq quelpa-use-package-inhibit-loading-quelpa t))

(use-package gnu-elpa-keyring-update)
#+end_src

* Auto Compile
#+begin_src emacs-lisp
(use-package auto-compile
  :init
  (setq auto-compile-display-buffer nil)
  (setq auto-compile-use-mode-line nil)
  :hook
  (emacs-lisp-mode-hook . auto-compile-on-load-mode)
  (emacs-lisp-mode-hook . auto-compile-on-save-mode))
#+end_src

* GC
#+begin_src emacs-lisp
(use-package gcmh
  :hook
  (after-init-hook . gcmh-mode))
#+end_src

* Defaults
#+begin_src emacs-lisp
(use-package emacs
  :ensure nil
  :init
  (setq load-prefer-newer t)
  (setq use-dialog-box nil)
  (setq enable-recursive-minibuffers t)
  (setq indent-tabs-mode nil)
  (setq create-lockfiles nil)
  (setq frame-resize-pixelwise t)
  (setq window-resize-pixelwise t)
  (setq inhibit-compacting-font-caches t)
  (setq scroll-step 1)
  (setq scroll-preserve-screen-position t)
  (setq scroll-margin 0)
  (setq scroll-conservatively 101)
  (setq ring-bell-function 'ignore)
  (setq delete-by-moving-to-trash t)
  (setq read-process-output-max (* 1024 1024))
  (setq bidi-inhibit-bpa t)
  (setq bidi-display-reordering 'left-to-right)
  (setq bidi-paragraph-direction 'left-to-right)
  (setq fast-but-imprecise-scrolling t)
  (setq native-comp-async-report-warnings-errors nil)
  :config
  (defalias 'yes-or-no-p 'y-or-n-p))
#+end_src

UTF-8
#+begin_src emacs-lisp
(use-package mule
  :ensure nil
  :init
  (setq default-input-method 'russian-computer)
  :config
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8))

(use-package emacs
  :ensure nil
  :init
  (setq buffer-file-coding-system 'utf-8))

(use-package select
  :ensure nil
  :init
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
#+end_src

Calendar
#+begin_src emacs-lisp
(use-package calendar
  :ensure nil
  :init
  (setq calendar-date-style 'iso)
  (setq calendar-week-start-day 1))
#+end_src

* Async
#+begin_src emacs-lisp
(use-package async
  :hook
  (after-init-hook . async-bytecomp-package-mode)
  (dired-mode-hook . dired-async-mode))
#+end_src

* General
#+begin_src emacs-lisp
(use-package general
  :config
  (general-create-definer -leader-def
    :states '(normal visual insert emacs motion)
    :keymaps 'override
    :prefix "SPC"
    :global-prefix "M-SPC")
  (general-create-definer -local-leader-def
    :states '(normal visual insert emacs motion)
    :keymaps 'override
    :prefix "SPC m"
    :global-prefix "M-,")
  (-leader-def
    ""    '(nil :wk "leader")
    "o"   '(:ignore t :wk "open")
    "O"   '(:ignore t :wk "org")
    "p"   '(:ignore t :wk "project")
    "P"   '(:ignore t :wk "package")
    "F"   '(:ignore t :wk "frame")
    "TAB" '(:ignore t :wk "tab")
    "b"   '(:ignore t :wk "buffer")
    "f"   '(:ignore t :wk "file")
    "e"   '(:ignore t :wk "emacs")
    "g"   '(:ignore t :wk "git")
    "/"   '(:ignore t :wk "search")
    "j"   '(:ignore t :wk "jump")
    "h"   '(:ignore t :wk "help")
    "t"   '(:ignore t :wk "toggle")
    "i"   '(:ignore t :wk "insert")
    "q"   '(:ignore t :wk "quit"))
  (-local-leader-def
    ""    '(nil :wk "local leader")))
#+end_src

* Evil
#+begin_src emacs-lisp
(use-package evil
  :demand
  :preface
  (defun -save-and-kill-buffer ()
    (interactive)
    (save-buffer)
    (kill-this-buffer))
  (defun -disable-evil-cursor ()
    (setq-local evil-default-cursor '(nil)))
  :general
  (evil-insert-state-map
   "C-k" nil)
  (-leader-def
    "j[" 'evil-jump-backward
    "j]" 'evil-jump-forward)
  :init
  (setq evil-want-keybinding nil)
  (setq evil-split-window-below t)
  (setq evil-vsplit-window-right t)
  (setq evil-emacs-state-cursor 'hbar)
  (setq evil-mode-line-format nil)
  (setq evil-symbol-word-search t)
  (setq evil-move-beyond-eol nil)
  (setq evil-move-cursor-back t)
  (setq evil-undo-system 'undo-redo)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode t)
  (evil-ex-define-cmd "q" 'kill-this-buffer)
  (evil-ex-define-cmd "wq" '-save-and-kill-buffer))

(use-package evil-collection
  :demand
  :after evil
  :init
  (setq evil-collection-company-use-tng nil)
  (setq evil-collection-magit-want-horizontal-movement t)
  :config
  (evil-collection-init))

(use-package evil-commentary
  :hook
  (after-init-hook . evil-commentary-mode))

(use-package evil-surround
  :hook
  (after-init-hook . global-evil-surround-mode))

(use-package evil-matchit
  :hook
  (after-init-hook . global-evil-matchit-mode))

(use-package evil-org
  :init
  (setq evil-org-key-theme '(todo textobjects insert navigation heading))
  :hook
  (org-mode-hook . evil-org-mode))

(use-package evil-org-agenda
  :demand
  :ensure evil-org
  :after org-agenda
  :config
  (evil-org-agenda-set-keys))

(use-package evil-mc
  :hook
  (after-init-hook . global-evil-mc-mode))

(use-package evil-traces
  :hook
  (after-init-hook . evil-traces-mode)
  :config
  (evil-traces-use-diff-faces))
#+end_src

* Which-key
#+begin_src emacs-lisp
(use-package which-key
  :init
  ;; Allow C-h to trigger which-key before it is done automatically
  (setq which-key-show-early-on-C-h t)
  ;; make sure which-key doesn't show normally but refreshes quickly after it is
  ;; triggered.
  (setq which-key-idle-delay 1.0)
  (setq which-key-idle-secondary-delay 0.05)
  :hook
  (after-init-hook . which-key-mode))
#+end_src

* Keyboard Layout
#+begin_src emacs-lisp
(use-package char-fold
  :ensure nil
  :init
  (setq char-fold-symmetric t)
  (setq search-default-mode #'char-fold-to-regexp))

(use-package reverse-im
  :general
  (evil-normal-state-map "C-х" 'evil-force-normal-state)
  (evil-insert-state-map "C-х" 'evil-normal-state)
  (evil-visual-state-map "C-х" 'evil-exit-visual-state)
  :init
  (setq reverse-im-char-fold t)
  (setq reverse-im-read-char-advice-function #'reverse-im-read-char-exclude)
  (setq reverse-im-input-methods '("russian-computer"))
  :hook
  (after-init-hook . reverse-im-mode))
#+end_src

* TTY
Mouse support
#+begin_src emacs-lisp
(use-package xt-mouse
  :unless (display-graphic-p)
  :ensure nil
  :hook
  (after-init-hook . xterm-mouse-mode))
#+end_src

* UI
#+begin_src emacs-lisp
(use-package startup
  :ensure nil
  :init
  (setq inhibit-startup-screen t)
  (setq initial-scratch-message nil))

(tooltip-mode -1)
(menu-bar-mode -1)

(when window-system
  (scroll-bar-mode -1)
  (tool-bar-mode -1))
#+end_src

* Fonts
Emoji
#+begin_src emacs-lisp
(when (eq window-system 'ns)
  (set-fontset-font "fontset-default" 'unicode "Apple Color Emoji" nil 'prepend))
#+end_src

Ligatures
#+begin_src emacs-lisp
(use-package ligature
  :ensure nil
  :if (display-graphic-p)
  :quelpa (ligature :fetcher github :repo "mickeynp/ligature.el")
  :config
  (ligature-set-ligatures
   'prog-mode
   '("-|" "-~" "---" "-<<" "-<" "--" "->" "->>" "-->" "///" "/=" "/=="
     "/>" "//" "/*" "*>" "***" "*/" "<-" "<<-" "<=>" "<=" "<|" "<||"
     "<|||" "<|>" "<:" "<>" "<-<" "<<<" "<==" "<<=" "<=<" "<==>" "<-|"
     "<<" "<~>" "<=|" "<~~" "<~" "<$>" "<$" "<+>" "<+" "</>" "</" "<*"
     "<*>" "<->" "<!--" ":>" ":<" ":::" "::" ":?" ":?>" ":=" "::=" "=>>"
     "==>" "=/=" "=!=" "=>" "===" "=:=" "==" "!==" "!!" "!=" ">]" ">:"
     ">>-" ">>=" ">=>" ">>>" ">-" ">=" "&&&" "&&" "|||>" "||>" "|>" "|]"
     "|}" "|=>" "|->" "|=" "||-" "|-" "||=" "||" ".." ".?" ".=" ".-" "..<"
     "..." "+++" "+>" "++" "[||]" "[<" "[|" "{|" "??" "?." "?=" "?:" "##"
     "###" "####" "#[" "#{" "#=" "#!" "#:" "#_(" "#_" "#?" "#(" ";;" "_|_"
     "__" "~~" "~~>" "~>" "~-" "~@" "$>" "^=" "]#"))
  :hook
  (after-init-hook . global-ligature-mode))
#+end_src

Icons
#+begin_src emacs-lisp
(use-package all-the-icons
  :if (display-graphic-p)
  :config
  (unless (member "all-the-icons" (font-family-list))
    (all-the-icons-install-fonts t)))
#+end_src

* Mode Line
#+begin_src emacs-lisp
(use-package faces
  :ensure nil
  :custom-face
  (mode-line ((t :inherit mode-line :box nil :underline nil :overline nil)))
  (mode-line-inactive ((t :inherit mode-line-inactive :box nil :underline nil :overline nil))))

(use-package hide-mode-line
  :hook
  (dired-sidebar-mode-hook . hide-mode-line-mode))

(use-package minions
  :hook
  (after-init-hook . minions-mode))

(use-package doom-modeline
  :init
  (setq doom-modeline-minor-modes t)
  (setq doom-modeline-buffer-file-name-style 'buffer-name)
  (setq doom-modeline-modal-icon nil)
  (setq doom-modeline-buffer-encoding nil)
  (setq doom-modeline-major-mode-icon nil)
  (setq doom-modeline-buffer-modification-icon nil)
  :hook
  (after-init-hook . doom-modeline-mode)
  :config
  (dolist (name '("*Compile-Log*" "*Async-native-compile-log*"))
    (when-let ((buffer (get-buffer name)))
      (with-current-buffer buffer
        (doom-modeline-set-main-modeline)))))
#+end_src

